app/Controllers/EmpleadoController.php

    public function index(){
        $empleado = new Empleado();
        $datos['head']= view('templates/head');
        $datos['cabecera']= view('templates/cabecera');
        $datos['footer']= view('templates/footer');
        $datos['empleados']= $empleado->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `empleado`
ORDER BY `id` ASC

    public function ver($id=null){
        $empleado= new Empleado();
        $contacto= new Contacto();
        $datos['empleado']=$empleado->where('id',$id)->first();
        $datos['contacto']=$contacto->where('empleado',$datos['empleado']['id'])->first();
---
SELECT *
FROM `empleado`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `info_contacto`
WHERE `empleado` = '1'
 LIMIT 1