app/Controllers/UsuarioController.php

    public function index(){
        $usuario = new Usuario();
        $datos['head']= view('templates/head');
        $datos['cabecera']= view('templates/cabecera');
        $datos['footer']= view('templates/footer');
        $datos['usuarios']= $usuario->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `usuario`
ORDER BY `id` ASC

    public function editar($id=null){
        $usuario= new Usuario();
        $datos['usuario']=$usuario->where('id',$id)->first();
---
SELECT *
FROM `usuario`
WHERE `id` = '1'
 LIMIT 1